Revit 2026 API

# ApplicationException Class

---

The exception that is thrown when a non-fatal application error occurs.

SystemObject SystemException Autodesk.Revit.ExceptionsApplicationException More

**Namespace:** Autodesk.Revit.Exceptions**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[SerializableAttribute]
public class ApplicationException : Exception
```
```vb
<SerializableAttribute>
Public Class ApplicationException
	Inherits Exception
```
```cpp
[SerializableAttribute]
public ref class ApplicationException : public Exception
```
```fsharp
[<SerializableAttribute>]
type ApplicationException =
    class
        inherit Exception
    end
```

The ApplicationException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Data | Gets a collection of key/value pairs that provide additional user-defined information about the exception.(Inherited from Exception) |
|  | FunctionId | The information of the function throwing the exception. |
|  | HelpLink | Gets or sets a link to the help file associated with this exception.(Inherited from Exception) |
|  | HResult | Gets or sets HRESULT, a coded numerical value that is assigned to a specific exception.(Inherited from Exception) |
|  | InnerException | Gets the Exception instance that caused the current exception.(Inherited from Exception) |
|  | Message | Gets a message that describes the current exception.(Inherited from Exception) |
|  | Source | Gets or sets the name of the application or the object that causes the error.(Inherited from Exception) |
|  | StackTrace | Gets a string representation of the immediate frames on the call stack.(Inherited from Exception) |
|  | TargetSite | Gets the method that throws the current exception.(Inherited from Exception) |

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetBaseException | When overridden in a derived class, returns the Exception that is the root cause of one or more subsequent exceptions.(Inherited from Exception) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides ExceptionGetObjectData(SerializationInfo, StreamingContext)) |
|  | GetType | Gets the runtime type of the current instance.(Inherited from Exception) |
|  | ToString | Creates and returns a string representation of the current exception.(Inherited from Exception) |

This class is the base class of all Revit specified exceptions.

#### Reference

Autodesk.Revit.Exceptions Namespace

SystemObject SystemException Autodesk.Revit.ExceptionsApplicationException Autodesk.Revit.ExceptionsAccessDeniedException Autodesk.Revit.ExceptionsArgumentException Autodesk.Revit.ExceptionsBackgroundTaskCancelledException Autodesk.Revit.ExceptionsCentralModelException Autodesk.Revit.ExceptionsCorruptModelException Autodesk.Revit.ExceptionsExternalApplicationException Autodesk.Revit.ExceptionsInternalException Autodesk.Revit.ExceptionsInvalidOperationException Autodesk.Revit.ExceptionsIOException Autodesk.Revit.ExceptionsNetworkCommunicationException Autodesk.Revit.ExceptionsOperationCanceledException Autodesk.Revit.ExceptionsResourceNotFoundException Autodesk.Revit.ExceptionsRevitServerException Autodesk.Revit.ExceptionsServerInternalException Autodesk.Revit.ExceptionsUnauthenticatedException